TAONAW.org
#+TITLE: TAONAW Hugo Version
#+OPTIONS: num:nil toc:nil \n:nil
#+TODO: TODO(t) CANCELLED(c) |  WIP(w) PUBLISHED(p)
#+hugo_base_dir: .
#+hugo_auto_set_lastmod: %Y-%m-%d

*** CANCELLED Of Distractions and Interruptions                     :privacy:
    :PROPERTIES:
    :EXPORT_HUGO_SECTION: Help Desk Head Desk
    :EXPORT_FILE_NAME: distractions_at_work
    :EXPORT_HUGO_PUBLISHDATE: 2018-11-28:
    :END:

**** Going down from 50 to 20 tickets

It was a Wednesday, and I was wondering how I cut down about half of my tickets in two days. The week started out with abotu 50 tickets, and I was now looking at 26 that were still active. Even though usually I hope to leave my desk for the weekend with no more than 20 active tickets, the most that would show on one page without clicking "next", this was definitely progress in the right direction.   

**** What helped, and why

There were a couple of helpful factors since Monday that I wanted to note for myself. 

First, management hired a temp who worked with us before. The guy was not only fast and hard-working, he also had a general understanding of our environment. It wasn't his knowledge that helped the most (though, it definitely came in handy), but the fact that he served as a "buffer" between us and the "fires" managment and customers had us take over. We all have rules we learn through our jobs, and in my case the rule is "it's never as simple as at looks." Basically, it means that if I'm dragged out of my dask for some rudimentary task, I'm going to spend 90% of the time getting to the root of the problem and 10% to fix the issue itself. 

Second, also thanks to the temp, I had someone to send to "probe" an existing task. It is often the case that a customer doesn't respond back, either allowing us to close the task as complete or get back to us with more necessary details, like you know, which computer out of our fleet has an issue. That alone allowed me to close around 10 tasks that were duplicates of others or were just hanging in the air with a question mark. 

Third, bigger boss was out, which means less pressure or boss to give side tasks. With no new projects, I was able to focus on my present issues dig out many stale incidents. 

Fourth, my other co-worker who had the second biggest queue was back in office and able to attend to tickets. This usually doesn't affect me as much because I don't cover his cases (unless its an emergency), but then again, it does. 

Fifth, Org-mode was working beatifully after my [[https://joshrollinswrites.com/techden/raspberry_pi_org_hub/][Pi setup]]. Everything I changed on my work VM synced beatifully to my home VM without issues, and my personal files (which include my wiki and journal, both of which I use at work) where accessible even though my home desktop was behind a VPN that blocks SSH. That's because my Pi is the only device now accessible to the outside world.  

**** How does Org help (mgt doesn't get it)

Org mode has long become my pillar of stability in an highly hectic environment. This is a repeated theme in this blog, I realize. This week is yet another fine example of working by my own order of things. With Org, I have an agenda that goes from hour to hour, from day to day. I know what ticket I need to look at before lunch, which incident needs a review before I leave for the day. I have titles that make sense to me the next day when I come in, and details that tell me exactly where I left off and what I should do next. With org, I have both personal and work related issue written down with me wherever I go, so my priorites are really /my/ priorities. 

I often think that a good manager should know how to align work priorties with that of his workers, not /force/ them. An excellent manager should be able to help train his workers to work like soliders in the battlefield. Each solider is obident and works according to instructions, but at the same time, can function completely independently if needs be. It's the opposite of micromanagment which freezes employees in their track without managment intevention and oftne give up and go home. 

This last part if what org is to me. It is my personal order of functions and my how-tos. At first glance, it looks like I'm giving myself extra work by copying every active issue over to this seemingly archaic text-only system. The truth is of course, that once it's in my system, I can follow through with it to completion with all the information I need available to me at all times, even after work hours. That, in my opinion, what makes me more productive than a mindless drone. 
